// 13.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"
#include <iostream>

int main()
{
    int a = 6;

    switch (a)
    {

    case 1:
        std::cout << 1;
        break;
    case 2:
        std::cout << 2;
        break;
    case 3:
        std::cout << 3;
        break;
    case 4:
        std::cout << 4;
        break;
    case 5:
        std::cout << 5;
        break;
    case 6:
        std::cout << 6;
        break;
    case 7:
        std::cout << 7;
        break;
    case 8:
        std::cout << 8;
        break;
    default:
        std::cout << 11;
        break;

    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
